# Что такое словари?

# В Python словарь (dictionary) - это структура данных, которая
# хранит пары ключ-значение.

# Отличительной особенностью словарей является то, что они
# позволяют быстро находить значение по ключу.

# -------------------------------------------------------------------------------------------------

# Словарь в Python создается с помощью фигурных скобок {}
# или функции dict()

# Каждый элемент словаря представляет собой пару ключзначение, разделенных двоеточием

fruits = {'apple': 1, 'banana': 2, 'orange': 3}
nums = dict(zip(['one', 'two', 'three'], [1, 2, 3]))

# Для доступа к значению по ключу используется оператор [].

fruits = {'apple': 1, 'banana': 2, 'orange': 3}
print(fruits['banana'])
# 2

# -------------------------------------------------------------------------------------------------

# Словари в Python являются изменяемыми.
# Для изменения значения элемента достаточно обратиться к
# нему по ключу и присвоить новое значение.
# Для добавления нового элемента используется оператор [] и
# присваивание.

fruits = {'apple': 1, 'banana': 2, 'orange': 3}
fruits["banana"] = 4 
# Изменение значения

fruits["kiwi"] = 5
# Добавление нового элемента

# -------------------------------------------------------------------------------------------------

# Для удаления элемента из словаря используется оператор 
# del------------------------------------------------------------------------------------------------------------------

fruits = {"apple":1, "banana":2, "orange":3}
del fruits["banana"]
# Удаление элемента

# -------------------------------------------------------------------------------------------------

# Для проверки наличия ключа в словаре используется оператор
# in------------------------------------------------------------------------------------------------------------------

fruits = {'apple': 1, 'banana': 2, 'orange': 3}
if "banana" in fruits:
    print("Ключ 'banana' найден " )
else:
    print("Нет такого ключа")

# -------------------------------------------------------------------------------------------------

# Итерация по словарю
# Можно перебирать элементы словаря с помощью 
# цикла for------------------------------------------------------------------------------------------------------------------
# При итерации по словарю возвращаются его ключи.

fruits = {"apple":1, "banana":2, "orange":3}
for key in fruits:
    print(key)
# Выводит ключи: apple, banana, orange

# -------------------------------------------------------------------------------------------------

# Методы словарей: ------------------------------------------------------------------------------------------------------------------

# Словари в Python имеют методы:
# keys() : возвращает список всех ключей в словаре,
# values() : возвращает список всех значений в словаре,
# items() : возвращает список пар ключ-значение в словаре,
# clear() : удаляет все элементы из словаря,
# copy() : создает копию словаря,
# update() : объединяет словари.

# -------------------------------------------------------------------------------------------------

# Пример методов keys, values и items

fruits = {"apple":1, "banana":2, "orange":3}
print(fruits.keys())

# ["apple", "banana", "orange"]

print(my_dict.values())

# [1, 2, 3]

print(my_dict.items())

# [ ("apple", 1), ("banana", 2), ("orange", 3) ]

# -------------------------------------------------------------------------------------------------

# Пример методов copy и clear

fruits = {"apple":1, "banana":2, "orange":3}

new_fruits = fruits.copy()
# Создаем копию словаря

new_fruits.clear()
# Очищаем словарь

print(new_fruits) # {}
print(fruits)

# {"apple":1, "banana":2, "orange":3}

# -------------------------------------------------------------------------------------------------

# Пример метода update

fruits = {"apple":1, "banana":2, "orange":3}

others = {"lime":7, "kiwi":5, "banana":4}

fruits.update(others)
# Обновляем словарь с новыми значениями

print(fruits)
# Выводим обновленный словарь

# {"apple":1, "banana":4, "orange":3, "lime":7, "kiwi":5}

# -------------------------------------------------------------------------------------------------
