# Методы словарей: ------------------------------------------------------------------------------------------------------------------

# Словари в Python имеют методы:
# keys() : возвращает список всех ключей в словаре,
# values() : возвращает список всех значений в словаре,
# items() : возвращает список пар ключ-значение в словаре,
# clear() : удаляет все элементы из словаря,
# copy() : создает копию словаря,
# update() : объединяет словари.

# ------------------------------------------------------------------------------------------------------------------
